Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/edc/ATSAMD20G16B.PIC
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x40000816"/>
      <edc:SFRDef ltx:memberofperipheral="SYSCTRL" edc:cname="OSC32K" edc:nzwidth="0x20" edc:access="---------nnnnnnn---n-nnnnn--nnn-" edc:por="00000000001111110000000010000000" edc:mclr="00000000001111110000000010000000" edc:impl="0x7F17CE" edc:_addr="0x40000818">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="EN32K" edc:nzwidth="0x1" edc:desc="32kHz Output Enable"/>
            <edc:SFRFieldDef edc:cname="EN1K" edc:nzwidth="0x1" edc:desc="1kHz Output Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:nzwidth="0x3" edc:desc="Oscillator Start-Up Time">
              <edc:SFRFieldSemantic edc:cname="CYCLE3" edc:desc="0.092 ms" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4" edc:desc="0.122 ms" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE6" edc:desc="0.183 ms" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE10" edc:desc="0.305 ms" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE18" edc:desc="0.549 ms" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE34" edc:desc="1.038 ms" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE66" edc:desc="2.014 ms" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE130" edc:desc="3.967 ms" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CALIB" edc:nzwidth="0x7" edc:desc="Oscillator Calibration"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SYSCTRL" edc:cname="OSCULP32K" edc:nzwidth="0x8" edc:access="n--nnnnn" edc:por="00001111" edc:mclr="00001111" edc:impl="0x9F" edc:_addr="0x4000081C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:SFRFieldDef edc:cname="CALIB" edc:nzwidth="0x5" edc:desc="Calibration Value"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x4000081D"/>
      <edc:SFRDef ltx:memberofperipheral="SYSCTRL" edc:cname="OSC8M" edc:nzwidth="0x20" edc:access="nn--nnnnnnnnnnnn------nnnn----n-" edc:por="10000111000001110000001110000010" edc:mclr="10000111000001110000001110000010" edc:impl="0xCFFF03C2" edc:_addr="0x40000820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Oscillator Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:SFRFieldDef edc:cname="PRESC" edc:nzwidth="0x2" edc:desc="Oscillator Prescaler">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="1" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="2" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="4" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="3" edc:desc="8" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CALIB" edc:nzwidth="0xC" edc:desc="Oscillator Calibration"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FRANGE" edc:nzwidth="0x2" edc:desc="Oscillator Frequency Range">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="4 to 6MHz" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="6 to 8MHz" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="8 to 11MHz" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="3" edc:desc="11 to 15MHz" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SYSCTRL" edc:cname="DFLLCTRL" edc:nzwidth="0x10" edc:access="------nnnn-nnnn-" edc:por="0000000010000000" edc:mclr="0000000010000000" edc:impl="0x3DE" edc:_addr="0x40000824">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x1" edc:desc="Mode Selection"/>
            <edc:SFRFieldDef edc:cname="STABLE" edc:nzwidth="0x1" edc:desc="Stable Frequency"/>
            <edc:SFRFieldDef edc:cname="LLAW" edc:nzwidth="0x1" edc:desc="Lose Lock After Wake"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run during Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="Enable on Demand"/>
            <edc:SFRFieldDef edc:cname="CCDIS" edc:nzwidth="0x1" edc:desc="Chill Cycle Disable"/>
            <edc:SFRFieldDef edc:cname="QLDIS" edc:nzwidth="0x1" edc:desc="Quick Lock Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
