Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/edc/ATSAMD20G16B.PIC
      <edc:AdjustPoint edc:offset="0x3BC" edc:_addr="0x40000844"/>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="CTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000C00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="r-------" edc:por="00000000" edc:mclr="00000000" edc:impl="0x80" edc:_addr="0x40000C01">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SYNCBUSY" edc:nzwidth="0x1" edc:desc="Synchronization Busy Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="CLKCTRL" edc:nzwidth="0x10" edc:access="nn--nnnn--nnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xCF3F" edc:_addr="0x40000C02">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x6" edc:desc="Generic Clock Selection ID">
              <edc:SFRFieldSemantic edc:cname="DFLL48M" edc:desc="DFLL48M Reference" edc:when="(field &amp; 0x3F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WDT" edc:desc="WDT" edc:when="(field &amp; 0x3F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RTC" edc:desc="RTC" edc:when="(field &amp; 0x3F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="EIC" edc:desc="EIC" edc:when="(field &amp; 0x3F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_0" edc:desc="EVSYS_CHANNEL_0" edc:when="(field &amp; 0x3F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_1" edc:desc="EVSYS_CHANNEL_1" edc:when="(field &amp; 0x3F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_2" edc:desc="EVSYS_CHANNEL_2" edc:when="(field &amp; 0x3F) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_3" edc:desc="EVSYS_CHANNEL_3" edc:when="(field &amp; 0x3F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_4" edc:desc="EVSYS_CHANNEL_4" edc:when="(field &amp; 0x3F) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_5" edc:desc="EVSYS_CHANNEL_5" edc:when="(field &amp; 0x3F) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_6" edc:desc="EVSYS_CHANNEL_6" edc:when="(field &amp; 0x3F) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_7" edc:desc="EVSYS_CHANNEL_7" edc:when="(field &amp; 0x3F) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="SERCOMX_SLOW" edc:desc="SERCOMx_SLOW" edc:when="(field &amp; 0x3F) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM0_CORE" edc:desc="SERCOM0_CORE" edc:when="(field &amp; 0x3F) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM1_CORE" edc:desc="SERCOM1_CORE" edc:when="(field &amp; 0x3F) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM2_CORE" edc:desc="SERCOM2_CORE" edc:when="(field &amp; 0x3F) == 0xF"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM3_CORE" edc:desc="SERCOM3_CORE" edc:when="(field &amp; 0x3F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM4_CORE" edc:desc="SERCOM4_CORE" edc:when="(field &amp; 0x3F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM5_CORE" edc:desc="SERCOM5_CORE" edc:when="(field &amp; 0x3F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="TC0_TC1" edc:desc="TC0,TC1" edc:when="(field &amp; 0x3F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="TC2_TC3" edc:desc="TC2,TC3" edc:when="(field &amp; 0x3F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="TC4_TC5" edc:desc="TC4,TC5" edc:when="(field &amp; 0x3F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="TC6_TC7" edc:desc="TC6,TC7" edc:when="(field &amp; 0x3F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="ADC" edc:desc="ADC" edc:when="(field &amp; 0x3F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="AC_DIG" edc:desc="AC_DIG" edc:when="(field &amp; 0x3F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="AC_ANA" edc:desc="AC_ANA" edc:when="(field &amp; 0x3F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC" edc:when="(field &amp; 0x3F) == 0x1A"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GEN" edc:nzwidth="0x4" edc:desc="Generic Clock Generator">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CLKEN" edc:nzwidth="0x1" edc:desc="Clock Enable"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
